autumn/frisbee/soap/check_retrieve_status.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Header>
  <ns1:SessionHeader soapenv:mustUnderstand="0" xmlns:ns1="http://soap.sforce.com/2006/04/metadata">
   <ns1:sessionId></ns1:sessionId>
  </ns1:SessionHeader>
 </soapenv:Header>
 <soapenv:Body>
  <ns2:checkRetrieveStatus xmlns:ns2="http://soap.sforce.com/2006/04/metadata">
    <ns2:asyncProcessId></ns2:asyncProcessId>
   </ns2:checkRetrieveStatus>
 </soapenv:Body>
</soapenv:Envelope>